<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"0f0fe0246937a68ab4fcd4bc91d78ab9d4d22ee3bcec8da38ec64199a622ec93","plan_job_ref":"Job Plan Airflow DAGs #534 at https://github.com/cal-itp/data-infra/actions/runs/17333762476","plan_out_hash":"a96bffb23c8161f9188bd838d1a7abab06d6a686c43caf005a016eef43108a84","plan_hash":"e180779eee7e24f3f884b419da319be8e776c5a76384c15f397da0ac7edaf7cb","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 2 to add, 10 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "J05Kfg==" -> (known after apply)
!~      detect_md5hash      = "4AECYFCGCHhAUElBpnttDA==" -> "different hash"
!~      generation          = 1756277113288469 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_v2/METADATA.yml"
!~      md5hash             = "4AECYFCGCHhAUElBpnttDA==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/parse_rt_service_alerts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "G2Oodg==" -> (known after apply)
!~      detect_md5hash      = "Kl66J8EnvE/BrY/rdAuguw==" -> "different hash"
!~      generation          = 1756277112893805 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_v2/parse_rt_service_alerts.yml"
!~      md5hash             = "Kl66J8EnvE/BrY/rdAuguw==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/parse_rt_service_alerts.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/parse_rt_trip_updates.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "SM57oQ==" -> (known after apply)
!~      detect_md5hash      = "JTYa+lyzWs9CkuYRyYd9CA==" -> "different hash"
!~      generation          = 1756277113305225 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_v2/parse_rt_trip_updates.yml"
!~      md5hash             = "JTYa+lyzWs9CkuYRyYd9CA==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/parse_rt_trip_updates.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/parse_rt_vehicle_positions.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "l8NWVw==" -> (known after apply)
!~      detect_md5hash      = "sKlIPD7txLeGlUvYqQbtAw==" -> "different hash"
!~      generation          = 1756277113323316 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_v2/parse_rt_vehicle_positions.yml"
!~      md5hash             = "sKlIPD7txLeGlUvYqQbtAw==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/parse_rt_vehicle_positions.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/validate_rt_service_alerts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "9fQx4w==" -> (known after apply)
!~      detect_md5hash      = "eQIxWqPYreITPXHADYOXBA==" -> "different hash"
!~      generation          = 1756277113324730 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_v2/validate_rt_service_alerts.yml"
!~      md5hash             = "eQIxWqPYreITPXHADYOXBA==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/validate_rt_service_alerts.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/validate_rt_trip_updates.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "wMSGuQ==" -> (known after apply)
!~      detect_md5hash      = "xM5eHDZTPvpap2o4VFpSZA==" -> "different hash"
!~      generation          = 1756277112920836 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_v2/validate_rt_trip_updates.yml"
!~      md5hash             = "xM5eHDZTPvpap2o4VFpSZA==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/validate_rt_trip_updates.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/validate_rt_vehicle_positions.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "WwuiXw==" -> (known after apply)
!~      detect_md5hash      = "BUdbWLW//KpPS5fxJX8pCw==" -> "different hash"
!~      generation          = 1756277113323691 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_v2/validate_rt_vehicle_positions.yml"
!~      md5hash             = "BUdbWLW//KpPS5fxJX8pCw==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/validate_rt_vehicle_positions.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_ntd_data_api/ridership/complete_monthly_ridership_with_adjustments_and_estimates.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/sync_ntd_data_api/ridership/complete_monthly_ridership_with_adjustments_and_estimates.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/sync_ntd_data_api/ridership/complete_monthly_ridership_with_adjustments_and_estimates.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_ntd_data_api/safety_service_and_security_historical/monthly_modal_time_series_safety_and_service.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "eXrvBg==" -> (known after apply)
!~      detect_md5hash      = "gL94wKlj2tpzwa5NjI93zA==" -> "different hash"
!~      generation          = 1751950420128166 -> (known after apply)
        id                  = "calitp-staging-composer-dags/sync_ntd_data_api/safety_service_and_security_historical/monthly_modal_time_series_safety_and_service.yml"
!~      md5hash             = "gL94wKlj2tpzwa5NjI93zA==" -> (known after apply)
        name                = "dags/sync_ntd_data_api/safety_service_and_security_historical/monthly_modal_time_series_safety_and_service.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_ntd_data_api/safety_service_and_security_historical/nonmajor_safety_and_security_events.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "EOeh1w==" -> (known after apply)
!~      detect_md5hash      = "u/WS3gWQKdIK3VZitwhz8g==" -> "different hash"
!~      generation          = 1751950420157727 -> (known after apply)
        id                  = "calitp-staging-composer-dags/sync_ntd_data_api/safety_service_and_security_historical/nonmajor_safety_and_security_events.yml"
!~      md5hash             = "u/WS3gWQKdIK3VZitwhz8g==" -> (known after apply)
        name                = "dags/sync_ntd_data_api/safety_service_and_security_historical/nonmajor_safety_and_security_events.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_ntd_data_xlsx/scrape_ntd_xlsx_urls.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "M0c82g==" -> (known after apply)
!~      detect_md5hash      = "vkd0XLY2rsewSvub2oZ19g==" -> "different hash"
!~      generation          = 1755712883441450 -> (known after apply)
        id                  = "calitp-staging-composer-dags/sync_ntd_data_xlsx/scrape_ntd_xlsx_urls.py"
!~      md5hash             = "vkd0XLY2rsewSvub2oZ19g==" -> (known after apply)
        name                = "dags/sync_ntd_data_xlsx/scrape_ntd_xlsx_urls.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/scripts/__init__.py"] will be destroyed
  # (because key ["plugins/scripts/__init__.py"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "AAAAAA==" -> null
-       detect_md5hash      = "1B2M2Y8AsgTpgAmY7PhCfg==" -> null
-       event_based_hold    = false -> null
-       generation          = 1756277113419546 -> null
-       id                  = "calitp-staging-composer-plugins/scripts/__init__.py" -> null
-       md5hash             = "1B2M2Y8AsgTpgAmY7PhCfg==" -> null
-       md5hexhash          = "d41d8cd98f00b204e9800998ecf8427e" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/plugins%2Fscripts%2F__init__.py?generation=1756277113419546&alt=media" -> null
-       metadata            = {} -> null
-       name                = "plugins/scripts/__init__.py" -> null
-       output_name         = "plugins/scripts/__init__.py" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/plugins%2Fscripts%2F__init__.py" -> null
-       source              = "../../../../airflow/plugins/scripts/__init__.py" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/scripts/gtfs_rt_parser.py"] will be destroyed
  # (because key ["plugins/scripts/gtfs_rt_parser.py"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "A6G3mA==" -> null
-       detect_md5hash      = "e3I/RF5j1Ylr69TTzvaaHg==" -> null
-       event_based_hold    = false -> null
-       generation          = 1756435633888419 -> null
-       id                  = "calitp-staging-composer-plugins/scripts/gtfs_rt_parser.py" -> null
-       md5hash             = "e3I/RF5j1Ylr69TTzvaaHg==" -> null
-       md5hexhash          = "7b723f445e63d5896bebd4d3cef69a1e" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/plugins%2Fscripts%2Fgtfs_rt_parser.py?generation=1756435633888419&alt=media" -> null
-       metadata            = {} -> null
-       name                = "plugins/scripts/gtfs_rt_parser.py" -> null
-       output_name         = "plugins/scripts/gtfs_rt_parser.py" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/plugins%2Fscripts%2Fgtfs_rt_parser.py" -> null
-       source              = "../../../../airflow/plugins/scripts/gtfs_rt_parser.py" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/payments/fct_payments_authorisations.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/mart/payments/fct_payments_authorisations.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/mart/payments/fct_payments_authorisations.sql"
+       storage_class  = (known after apply)
    }

Plan: 2 to add, 10 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #534](https://github.com/cal-itp/data-infra/actions/runs/17333762476)